

num=9 #设备数量



for i in range(1,num+1):
    
#     print(""" 
# if (总步数>{0} and 注射匀胶选择{0}>2) or 总步数<{0} then 注射匀胶选择{0}=0
# if 总步数={0} and 注射匀胶选择{0}<3 then 注射匀胶选择{0}=3
# if 注射匀胶选择{0}>4 then 注射匀胶选择{0}=0
# if index=0 then
#     if 注射匀胶选择{0}=0 then 注射匀胶选择显示{0}="空"
#     if 注射匀胶选择{0}=1 then 注射匀胶选择显示{0}="注射"
#     if 注射匀胶选择{0}=2 then 注射匀胶选择显示{0}="旋转"
#     if 注射匀胶选择{0}=3 then 注射匀胶选择显示{0}="重复"
#     if 注射匀胶选择{0}=4 then 注射匀胶选择显示{0}="结束"
# endif
# if index=1 then
#     if 注射匀胶选择{0}=0 then 注射匀胶选择显示{0}="Null"
#     if 注射匀胶选择{0}=1 then 注射匀胶选择显示{0}="Inject"
#     if 注射匀胶选择{0}=2 then 注射匀胶选择显示{0}="Revolve"
#     if 注射匀胶选择{0}=3 then 注射匀胶选择显示{0}="Repeat"
#     if 注射匀胶选择{0}=4 then 注射匀胶选择显示{0}="End"
# endif
#  """.format(i,i+1))
#     print("""
# '=========================================================================================
# '步{0}
# '=========================================================================================
# if 程序步={0} and 自动标志=1  then
#     if 注射匀胶选择{0}=0 then 程序步=程序步+1 '空操作,直接跳过当前步
#     if 动作延迟时间{0}>0 and 计时标志{0}=0 then  '有延时时间则等待延时
#         !TimerRun({1})
#         计时标志{0}=1
#     endif
#     if 程序步={0} and 自动标志=1 and 计时标志{0}=1 then
#         myTimer{0}=!TimerValue({1},0)        
#         if myTimer{0}>动作延迟时间{0} then
#             if 注射匀胶选择{0}=1 then '注射操作
#                 注射器号=步{0}注射器号
#                 自动注射标志=1
#                 程序步=程序步+1
#             endif

#             if 注射匀胶选择{0}=2 then '匀胶操作
#                 步匀胶速度=步{0}匀胶速度
#                 步匀胶时间=步{0}匀胶时间
#                 步匀胶加速度=步{0}匀胶加速度
#                 程序步=程序步+1
#             endif

#             if 注射匀胶选择{0}=3 and 重复次数>1 then '重复
#                 程序步=1
#                 自动执行次数=自动执行次数+1
#             endif
#             if 注射匀胶选择{0}=3 and 重复次数<2 then '选择重复,实际结束
#                 程序步=0
#                 自动执行次数=0
#                 自动标志=0
#             endif
#             if 注射匀胶选择{0}=4 then '结束
#                 程序步=0
#                 自动执行次数=0
#                 自动标志=0
#             endif
#             !TimerStop({1})
#             !TimerReset({1},0)
#             计时标志{0}=0
#         endif
#     endif   
# endif
    
#     """.format(i,i+6))
        print("""
!TimerStop({0})
!TimerReset({0},0)
        """.format(i+6))