

num=60 #设备数量
a=""

L=r"转速A1,时长A1,加速度A1,转速A2,时长A2,加速度A2,转速A3,时长A3,加速度A3,转速A4,时长A4,加速度A4,转速A5,时长A5,加速度A5,转速B1,时长B1,加速度B1,转速B2,时长B2,加速度B2,转速B3,时长B3,加速度B3,转速B4,时长B4,加速度B4,转速B5,时长B5,加速度B5,转速C1,时长C1,加速度C1,转速C2,时长C2,加速度C2,转速C3,时长C3,加速度C3,转速C4,时长C4,加速度C4,转速C5,时长C5,加速度C5,转速D1,时长D1,加速度D1,转速D2,时长D2,加速度D2,转速D3,时长D3,加速度D3,转速D4,时长D4,加速度D4,转速D5,时长D5,加速度D5"
m=L.split(",")

for i in range(4353,4353+num):
   
    print("""!SetDevice(设备0, 6, "Write(4,{0},WUB={1})") """.format(i,m[i-4353]))
    # print("""
# '=========================================================================================
# '步{0}
# '=========================================================================================
# if 程序步={0} and 自动标志=1  then
#     if 注射匀胶选择{0}=0 then 程序步=程序步+1 '空操作,直接跳过当前步
#     if 动作延迟时间{0}>=0 and 计时标志{0}=0 then  '有延时时间则等待延时
#         !TimerRun({1})
#         计时标志{0}=1
#     endif
#     if 程序步={0} and 自动标志=1 and 计时标志{0}=1 then
#         myTimer{0}=!TimerValue({1},0)        
#         if myTimer{0}>动作延迟时间{0} then
#             if 注射匀胶选择{0}=1 then '注射操作
#                 注射器号=步{0}注射器号
#                 自动注射标志=1
#                 程序步=程序步+1
#             endif

#             if 注射匀胶选择{0}=2 then '匀胶操作
#                 步匀胶速度=步{0}匀胶速度
#                 步匀胶时间=步{0}匀胶时间
#                 步匀胶加速度=步{0}匀胶加速度
#                 程序步=程序步+1
#             endif

#             if 注射匀胶选择{0}=3 and 重复次数>1 then '重复
#                 程序步=1
#                 自动执行次数=自动执行次数+1
#             endif
#             if 注射匀胶选择{0}=3 and 重复次数<2 then '选择重复,实际结束
#                 程序步=0
#                 自动执行次数=0
#                 自动标志=0
#             endif
#             if 注射匀胶选择{0}=4 then '结束
#                 程序步=0
#                 自动执行次数=0
#                 自动标志=0
#             endif
#             !TimerStop({1})
#             !TimerReset({1},0)
#             计时标志{0}=0
#         endif
#     endif   
# endif
    
#     """.format(i,i+6))
#         print("""
# !TimerStop({0})
# !TimerReset({0},0)
#         """.format(i+6))